AndEmi81/indesit_inertia_rx210/HAL/NX_M0_LPC1227/NX_M0_LPC1227_reg.h
/*@}*/ /* end of group LPC12xx_CRC */


/*------------- Flash Memory Controller (FMC) ----------------------------*/
/** @addtogroup LPC12xx_FMC LPC12xx Flash Memory Controller
  @{
*/
typedef struct
{
  __IO uint32_t TBCFG;            /* Time Base Config register  */
  __IO uint32_t FINSTR;           /* Flash Instruction register */
  __I  uint32_t INSSTA;           /* Raw Instruction Status register */
  __IO uint32_t INSSCLR;          /* Raw Instruction Clear register */
  __IO uint32_t INT_EN;           /* Interrupt Enable register */
  __I  uint32_t INT_STA;          /* Interrupt Status register */
       uint32_t RESERVED0;
  __IO uint32_t ADDRLAT;          /* Address Latch registers */
  __IO uint32_t DATALAT;          /* Data Latch register */
  __IO uint32_t FIMC;             /* Flash Manaul Operation register */
  __IO uint32_t RDCFG;            /* Read Configuration register */
  __IO uint32_t EPPCFG;           /* Flash Programming Permission Cofig register */
  __IO uint32_t EPPAA;            /* Flash Programming Permission Address A register */
  __IO uint32_t EPPAB;            /* Flash Programming Permission Address B register */
} LPC_FMC_TypeDef;
/*@}*/ /* end of group LPC12xx_FMC */


#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/* Base addresses                                                             */
#define LPC_FLASH_BASE        (0x00000000UL)
#define LPC_RAM_BASE          (0x10000000UL)
#define LPC_APB0_BASE         (0x40000000UL)
#define LPC_AHB_BASE          (0x50000000UL)

/* APB0 peripherals                                                           */
#define LPC_I2C_BASE          (LPC_APB0_BASE + 0x00000)
#define LPC_WDT_BASE          (LPC_APB0_BASE + 0x04000)
#define LPC_UART0_BASE        (LPC_APB0_BASE + 0x08000)
#define LPC_UART1_BASE        (LPC_APB0_BASE + 0x0C000)
#define LPC_CT16B0_BASE       (LPC_APB0_BASE + 0x10000)
#define LPC_CT16B1_BASE       (LPC_APB0_BASE + 0x14000)
#define LPC_CT32B0_BASE       (LPC_APB0_BASE + 0x18000)
#define LPC_CT32B1_BASE       (LPC_APB0_BASE + 0x1C000)
#define LPC_ADC_BASE          (LPC_APB0_BASE + 0x20000)
#define LPC_PMU_BASE          (LPC_APB0_BASE + 0x38000)
#define LPC_SSP_BASE          (LPC_APB0_BASE + 0x40000)
#define LPC_IOCON_BASE        (LPC_APB0_BASE + 0x44000)
#define LPC_SYSCON_BASE       (LPC_APB0_BASE + 0x48000)
#define LPC_DMA_BASE          (LPC_APB0_BASE + 0x4C000)
#define LPC_RTC_BASE          (LPC_APB0_BASE + 0x50000)
#define LPC_COMP_BASE         (LPC_APB0_BASE + 0x54000)

/* AHB peripherals                                                            */	
#define LPC_GPIO_BASE         (LPC_AHB_BASE  + 0x00000)
#define LPC_GPIO0_BASE        (LPC_AHB_BASE  + 0x00000)
#define LPC_GPIO1_BASE        (LPC_AHB_BASE  + 0x10000)
#define LPC_GPIO2_BASE        (LPC_AHB_BASE  + 0x20000)
#define LPC_GPIO3_BASE        (LPC_AHB_BASE  + 0x30000)
#define LPC_FMC_BASE          (LPC_AHB_BASE  + 0x60000)
#define LPC_CRC_BASE          (LPC_AHB_BASE  + 0x70000)

/******************************************************************************/
/*                         Peripheral declaration                             */
/******************************************************************************/
#define LPC_I2C               ((LPC_I2C_TypeDef    *) LPC_I2C_BASE   )
#define LPC_WDT               ((LPC_WDT_TypeDef    *) LPC_WDT_BASE   )
#define LPC_UART0             ((LPC_UART_TypeDef   *) LPC_UART0_BASE)
#define LPC_UART1             ((LPC_UART_TypeDef   *) LPC_UART1_BASE)
#define LPC_TMR16B0           ((LPC_TMR_TypeDef    *) LPC_CT16B0_BASE)
#define LPC_TMR16B1           ((LPC_TMR_TypeDef    *) LPC_CT16B1_BASE)
#define LPC_TMR32B0           ((LPC_TMR_TypeDef    *) LPC_CT32B0_BASE)
#define LPC_TMR32B1           ((LPC_TMR_TypeDef    *) LPC_CT32B1_BASE)
#define LPC_ADC               ((LPC_ADC_TypeDef    *) LPC_ADC_BASE   )
#define LPC_PMU               ((LPC_PMU_TypeDef    *) LPC_PMU_BASE   )
#define LPC_SSP               ((LPC_SSP_TypeDef    *) LPC_SSP_BASE  )
#define LPC_IOCON             ((LPC_IOCON_TypeDef  *) LPC_IOCON_BASE )
#define LPC_SYSCON            ((LPC_SYSCON_TypeDef *) LPC_SYSCON_BASE)
#define LPC_DMA               ((LPC_DMA_TypeDef    *) LPC_DMA_BASE)
#define LPC_RTC               ((LPC_RTC_TypeDef    *) LPC_RTC_BASE)
#define LPC_COMP              ((LPC_COMP_TypeDef   *) LPC_COMP_BASE)
#define LPC_GPIO0             ((LPC_GPIO_TypeDef   *) LPC_GPIO0_BASE )
#define LPC_GPIO1             ((LPC_GPIO_TypeDef   *) LPC_GPIO1_BASE )
#define LPC_GPIO2             ((LPC_GPIO_TypeDef   *) LPC_GPIO2_BASE )
#define LPC_FMC               ((LPC_FMC_TypeDef    *) LPC_FMC_BASE)
#define LPC_CRC               ((LPC_CRC_TypeDef    *) LPC_CRC_BASE)




/* I2C control set register */
#define __REG32 unsigned long
typedef union
  {
   struct
      {
      __REG32       : 2;
      __REG32 AA    : 1;
      __REG32 SI    : 1;
      __REG32 STO   : 1;
      __REG32 STA   : 1;
      __REG32 I2EN  : 1;
      __REG32       :25;
      }bits;
   
  }__i2conset_bits;

/* I2C control clear register */
typedef union
{
struct{
__REG32        : 2;
__REG32 AAC    : 1;
__REG32 SIC    : 1;
__REG32        : 1;
__REG32 STAC   : 1;
__REG32 I2ENC  : 1;
__REG32        :25;
}bits;
} __i2conclr_bits;

/* I2C status register */
typedef union 
{
  struct{
__REG32 STATUS  : 8;
__REG32         :24;
}bits;
} __i2stat_bits;

/* I2C data register */
typedef union
{
 __REG32 Byte; 
  
  struct{
__REG32 DATA   : 8;
__REG32       :24;
}bits;
} __i2dat_bits;

/* I2C Monitor mode control register */
typedef union{
  struct{
__REG32 MM_ENA    : 1;
__REG32 ENA_SCL   : 1;
__REG32 MATCH_ALL : 1;
__REG32           :29;
}bits;
} __i2cmmctrl_bits;

/* I2C slave address register */
typedef union 
{
  struct{
__REG32 GC    : 1;
__REG32 ADDR  : 7;
__REG32       :24;
}bits;
} __i2adr_bits;

/* I2C Mask registers */
typedef union
{
  struct{
__REG32       : 1;
__REG32 MASK  : 7;
__REG32       :24;
}bits;
} __i2cmask_bits;

/* I2C SCL High Duty Cycle register */
typedef union
{
  struct{
__REG32 SCLH   :16;
__REG32        :16;
}bits;
} __i2sch_bits;

/* I2C scl duty cycle register */
typedef union
{
  struct{
__REG32 SCLL   :16;
__REG32        :16;
}bits;
} __i2scl_bits;



extern volatile __i2conset_bits  _I2C0CONSET;      
extern volatile __i2stat_bits    _I2C0STAT;
extern volatile __i2dat_bits     _I2C0DAT;
extern volatile __i2adr_bits     _I2C0ADR;
extern volatile __i2sch_bits     _I2C0SCLH;
extern volatile __i2scl_bits     _I2C0SCLL;
extern volatile __i2conclr_bits  _I2C0CONCLR;
extern volatile __i2cmmctrl_bits _I2C0MMCTRL;
extern volatile __i2adr_bits     _I2C0ADR1;
extern volatile __i2adr_bits     _I2C0ADR2;
extern volatile __i2adr_bits     _I2C0ADR3;
//extern volatile __i2dat_bits     _I2C0DATABUFFER;
extern  uint8_t                  _I2C0DATABUFFER;
extern volatile __i2cmask_bits   _I2C0MASK0;
extern volatile __i2cmask_bits   _I2C0MASK1;
extern volatile __i2cmask_bits   _I2C0MASK2;
extern volatile __i2cmask_bits   _I2C0MASK3;


#define _RST_COPY_VALUE         (*((unsigned int    *) 0x10001FDC))
#define _BOOT_KEY               (*((unsigned int    *) 0x10001FD8))

#ifdef __cplusplus
}
#endif

#endif  /* __LPC12xx_H__ */
